{"Douglas-Cowie2000": false, "Steidl2009": {"names": "Schuller, B; Batliner, A; Steidl, S; Seppi, D", "full_names": "Schuller, Bjoern; Batliner, Anton; Steidl, Stefan; Seppi, Dino", "title": "EMOTION RECOGNITION FROM SPEECH: PUTTING ASR IN THE LOOP", "journal": "2009 IEEE INTERNATIONAL CONFERENCE ON ACOUSTICS, SPEECH, AND SIGNAL PROCESSING, VOLS 1- 8, PROCEEDINGS", "language": "English", "publication_type": "Proceedings Paper", "author_keywords": "Speech analysis; Speech recognition; Feature extraction", "keywords_plus": NaN, "abstract": "This paper investigates the automatic recognition of emotion from spoken words by vector space modeling vs. string kernels which have not been investigated in this respect, yet. Apart from the spoken content directly, we integrate Pan-of-Speech and higher semantic tagging in our analyses. As opposed to most works in the field, we evaluate the performance with an ASR engine in the loop. Extensive experiments are run on the FAU Aibo Emotion Corpus of 4k spontaneous emotional child-robot interactions and show surprisingly low performance degradation with real ASR over transcription-based emotion recognition. In the result, bag of words dominate over all other modeling forms based on the spoken content.", "affiliation": "[Schuller, Bjoern] Tech Univ Munich, Inst Human Machine Commun, D-8000 Munich, Germany; [Batliner, Anton; Steidl, Stefan] Univ Erlangen Nurnberg, Lehrstuhl Mustererkennung, Nurnberg, Germany; [Seppi, Dino] Polderland Language & Speech Technol, Nijmegen, Netherlands", "author_information": "Schuller, B (reprint author), Tech Univ Munich, Inst Human Machine Commun, D-8000 Munich, Germany.", "email": "schuller@IEEE.org; batliner@informatik.uni-erlangen.de; dino@polderland.nl", "citation_count_WOS": 16, "wos_usage_count_180": 0, "wos_usage_count_2013": 1, "journal_abbr": NaN, "month_day": NaN, "year": 2009, "volume": NaN, "issue": NaN, "category1": "Acoustics; Engineering, Electrical & Electronic", "category2": "Acoustics; Engineering", "DOI": "10.1109/ICASSP.2009.4960651"}}